modules/v1/models/User.php

SELECT * FROM `user` WHERE `token`='BJHTN8rL9PfemW3Ws5shZK90jYh-RZ3QOXXDD9M3lXPe-GDE1pOPaHfN_JTxQprV'
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['token' => $token]);