modules/v1/controllers/OrganizationController.php

        if(isset($params['published'])) {
            $organization->published = $params['published'];
        }
        $organization->save();
---
INSERT INTO `organization` (`user_id`, `name`, `email`, `alias`, `longname`, `description`, `image`, `locality_id`, `address`, `phone`, `latitude`, `longitude`, `published`) VALUES (2, 'Привет привет', 'sdfsd', 'privet-privet', 'sdfsdfsd', 'sdfsdf', 'sdfsdf', 25, 'sdfsd', 'sdfsdfsdf', '321', '234', 1)

    public function actionUpdate($id)
    {
        $organization = Organization::findOne($id);
---
SELECT * FROM `organization` WHERE `id`='1'

        if(isset($params['published'])) {
            $organization->published = $params['published'];
        }
        $organization->save();
---
UPDATE `organization` SET `published`=1 WHERE `id`=1